ErpTest/src/Documents/уатРазнарядка/уатРазнарядка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатРазнарядка</name>
  <comment>Разнарядка на выпуск ТС</comment>
  <registerRecords>InformationRegister.уатСостояниеТС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <comment>Колонна</comment>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разнарядка</name>
    <comment>Разнарядка</comment>
    <attributes>
      <name>АдресПрибытия</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПрибытия2</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресУбытия1</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресУбытия2</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <comment>Водитель</comment>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель2</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия2</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяУбытия</name>
      <comment>Время убытия</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяУбытия2</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Груз1</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Груз2</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозвращения</name>
      <comment>Дата возвращения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыезда</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Кондуктор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Кондуктор2</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент2</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>Подразделение</comment>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение2</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Прицеп1</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Прицеп2</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботыТС</name>
      <comment>Режим работы ТС</comment>
      <type>
        <types>CatalogRef.уатРежимыРаботыТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут1</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут2</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/уатМестонахождениеТС/уатМестонахождениеТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатМестонахождениеТС</name>
  <comment>(уат)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </resources>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатВидыМоделейТС/уатВидыМоделейТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыМоделейТС</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Автотранспорт</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/ChartsOfCharacteristicTypes/уатПраваИНастройки/уатПраваИНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>уатПраваИНастройки</name>
  <comment>Классификатор прав и настроек конфигурации</comment>
  <type>
    <types>EnumRef.уатВидыПравДляДокументов</types>
    <types>CatalogRef.Номенклатура</types>
    <types>EnumRef.уатРежимФильтрации</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.СтатьиКалькуляции</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.ВидыРаботСотрудников</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.РолиИсполнителей</types>
    <types>EnumRef.уатВидыРасчетаРасходаГСМ</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.уатВидыПравДляСправочников</types>
    <types>Boolean</types>
    <types>EnumRef.уатРежимПрефиксации</types>
    <types>CatalogRef.Контрагенты</types>
    <types>EnumRef.уатВидыОперацийЗаказГрузоотправителя</types>
    <types>EnumRef.СпособыОценки</types>
    <types>EnumRef.уатВидыПЛ</types>
    <types>EnumRef.уатВидыПроверкиПопаданияЗаправкиВПериодПЛ</types>
    <types>CatalogRef.уатГруппыПользователейДляСогласования</types>
    <types>ChartOfCalculationTypesRef.Начисления</types>
    <types>String</types>
    <types>EnumRef.уатРегистрироватьЗаявкиНаЗаказыГрузоотправителей</types>
    <types>EnumRef.уатВидыДвиженияГСМ</types>
    <types>Date</types>
    <types>Number</types>
    <types>EnumRef.уатРежимыРасчетаВыработкиПЛ</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.уатАЗС</types>
    <types>CatalogRef.уатВидыПеревозок</types>
    <types>CatalogRef.Склады</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Документы</name>
      <description>ДОКУМЕНТЫ</description>
      <code>40000</code>
        </content>
        </content>
        </content>
        </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ОбщиеПраваДоступа</name>
      <description>ОБЩИЕ ПРАВА ДОСТУПА</description>
      <code>10000</code>
    </items>
    <items>
      <name>Отчеты</name>
      <description>ОТЧЕТЫ</description>
      <code>50000</code>
    </items>
    <items>
      <name>ПараметрыСистемы</name>
      <description>ПАРАМЕТРЫ СИСТЕМЫ</description>
      <code>70000</code>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Справочники</name>
      <description>СПРАВОЧНИКИ</description>
      <code>30000</code>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Значение права / настройки по умолчанию</comment>
    <type>
      <types>Characteristic.уатПраваИНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <comment>Признак доступности права / настройки для компании / организации / подразделения / пользователя</comment>
    <type>
      <types>EnumRef.уатНазначениеПравИНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКомпании</name>
    <comment>Настройка компании</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОрганизации</name>
    <comment>Настройка организации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПодразделения</name>
    <comment>Настройка подразделения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПользователя</name>
    <comment>Настройка пользователя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНастройка</name>
    <comment>Настройки могут изменяться пользователем, Права изменяются только администратором</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ErpTest/src/Documents/уатРазнарядка/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура перезаполняет таблицу Разнарядки
Процедура ЗаполнитьТаблицы() Экспорт
	Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(Организация) Тогда
		Сообщить("Не указана организация!");
		Возврат;
	КонецЕсли;
	
	Разнарядка.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СправочникТранспортныеСредства.уатМодель КАК Модель,
	|	СправочникТранспортныеСредства.уатГаражныйНомер КАК ГарНомер,
	|	СправочникТранспортныеСредства.Код КАК ГосНомер,
	|	СправочникТранспортныеСредства.уатГараж КАК Гараж,
	|	СправочникТранспортныеСредства.Ссылка КАК ТС,
	|	уатМестонахождениеТССрезПоследних.Организация КАК Организация,
	|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна,
	|	СправочникТранспортныеСредства.уатОсновнойРежимРаботы КАК РежимРаботыТС
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК СправочникТранспортныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДатаНач, ) 
	|			КАК уатМестонахождениеТССрезПоследних
	|		ПО СправочникТранспортныеСредства.Ссылка = уатМестонахождениеТССрезПоследних.ТС
	|ГДЕ
	|	уатМестонахождениеТССрезПоследних.Организация = &Организация
	|	И СправочникТранспортныеСредства.уатМодель.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Автотранспорт)
	|	И (СправочникТранспортныеСредства.Тип = &ПустойТипТС
	|			ИЛИ (НЕ СправочникТранспортныеСредства.Тип.уатВидТС В (&СписокПрицепов)))
	|	И (СправочникТранспортныеСредства.уатДатаВыбытия = &ПустаяДата
	|			ИЛИ СправочникТранспортныеСредства.уатДатаВыбытия > &ДатаДокумента)";
	
	Если ЗначениеЗаполнено(Колонна) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И уатМестонахождениеТССрезПоследних.Колонна В Иерархии (&Колонна)";
		Запрос.УстановитьПараметр("Колонна", Колонна);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("ПустойТипТС", Справочники.ТипыТранспортныхСредств.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокПрицепов", уатОбщегоНазначения.уатСписокВидовТСПрицепов());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	тблРазнарядка = Разнарядка.Выгрузить();
	тблРазнарядка.Колонки.Добавить("ГарНомер");
	тблРазнарядка.Колонки.Добавить("ГосНомер");
	Для Каждого ТекСтрока Из Запрос.Выполнить().Выгрузить() Цикл
		НоваяСтрока = тблРазнарядка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	Для каждого ТекСтрока из тблРазнарядка Цикл
		// Заполняем прицепы по умолчанию
		тСч = 0;
		СоставТС = уатОбщегоНазначения.уатСоставТС(ТекСтрока.ТС);
		Для Каждого тСтрока из СоставТС Цикл
			тСч = тСч + 1;
			Если тСч = 1 Тогда 
				ТекСтрока.Прицеп1 = тСтрока.ТС;
			ИначеЕсли тСч = 2 Тогда
				ТекСтрока.Прицеп2 = тСтрока.ТС;
			Иначе	
				Прервать; 
			КонецЕсли;
		КонецЦикла;	
		
		Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ТекСтрока.РежимРаботыТС) Тогда
			#Если Клиент Тогда
				ТекСтрока.ДатаВыезда = НачалоДня(Дата) + (уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
					Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ВремяВыездаПЛ) - '00010101');
				ТекСтрока.ДатаВозвращения = НачалоДня(Дата) + (уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
					Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ВремяВозращенияПЛ) - '00010101');
			#КонецЕсли
		Иначе	
			ТекСтрока.ДатаВыезда = НачалоДня(Дата) + (ТекСтрока.РежимРаботыТС.НачалоРаботы - НачалоДня(
				ТекСтрока.РежимРаботыТС.НачалоРаботы));
			ТекСтрока.ДатаВозвращения = НачалоДня(Дата) + (ТекСтрока.РежимРаботыТС.КонецРаботы - НачалоДня(
				ТекСтрока.РежимРаботыТС.КонецРаботы));
		КонецЕсли;	
		Если ТекСтрока.ДатаВозвращения <= ТекСтрока.ДатаВыезда Тогда
			ТекСтрока.ДатаВозвращения = НачалоДня(Дата) + 86400 + (ТекСтрока.ДатаВозвращения - НачалоДня(
				ТекСтрока.ДатаВозвращения));
		КонецЕсли;	
		
		//заполняем водителей
		СтруктураЭкипаж = уатЗащищенныеФункцииСервер.ЭкипажТСсУчетомГрафика(ТекСтрока.ТС, ТекСтрока.ДатаВыезда, Организация);
		ТекСтрока.Водитель = СтруктураЭкипаж.Водитель;
		ТекСтрока.Водитель2 = СтруктураЭкипаж.Водитель2;
		ТекСтрока.Кондуктор = СтруктураЭкипаж.Сотрудник;
		ТекСтрока.Кондуктор2 = СтруктураЭкипаж.Сотрудник2;
	КонецЦикла;
	
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.ПредставлениеТСКакГосНомер) = Истина Тогда
		тблРазнарядка.Сортировать("ДатаВыезда, ГосНомер");
	Иначе
		тблРазнарядка.Сортировать("ДатаВыезда, ГарНомер");
	КонецЕсли;
	
	Разнарядка.Загрузить(тблРазнарядка);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатРазнарядка.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение.ОтразитьСостояниеТС(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатРазнарядка.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.уатРазнарядка.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	//проверка ТС на признак автотранспорта
	Для Каждого ТекСтрока Из Разнарядка Цикл
		Если НЕ ТекСтрока.ТС.уатВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт Тогда
			ТекстСообщения = "В строке №" + ТекСтрока.НомерСтроки + " ТС не является автотранспортом (выбрано оборудование)!";
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	//проверка на пересечения занятости (состояния) ТС по времени
	Для Каждого ТекСтрока Из Разнарядка Цикл
		Для Каждого ТекСтрокаВлож Из Разнарядка Цикл
			Если Разнарядка.Индекс(ТекСтрокаВлож) <= Разнарядка.Индекс(ТекСтрока) ИЛИ ТекСтрока.ТС <> ТекСтрокаВлож.ТС Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрока.ДатаВыезда < ТекСтрокаВлож.ДатаВозвращения И
					ТекСтрока.ДатаВозвращения > ТекСтрокаВлож.ДатаВыезда Тогда
				ТекстСообщения = "В строках №" + ТекСтрока.НомерСтроки + " и " + ТекСтрокаВлож.НомерСтроки +
					" обнаружено пересечение периодов занятости (состояние ТС) одного и того же ТС!";
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
